In [1]:
import pandas as pd
import geopandas as gpd
import numpy as np
import matplotlib.pyplot as plt
import shapely as shp
import geoplot
%matplotlib inline

In [2]:
weather_geo_demographic = gpd.read_file('weather_geo_demographic.shp')

# Merge each dataset to weather_geo_demographic shape

## Green Trips

In [3]:
green = pd.read_csv('green_trips_new_2.csv')
#Transforms string to datetime
#green['pickup_dt'] = pd.to_datetime(green['pickup_datetime'],infer_datetime_format=True)
#green['dropoff_dt'] = pd.to_datetime(green['dropoff_datetime'],infer_datetime_format=True)
#green.drop(['pickup_datetime'],axis=1,inplace=True)
#green.drop(['dropoff_datetime'],axis=1,inplace=True)
green[:3]

,pickup_datetime,dropoff_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,trip_distance,total_amount
0,2015-02-01 01:26:45,2015-02-01 01:49:58,-73.953545,40.811172,-73.984764,40.728386,1,8.11,27.8
1,2015-01-02 20:06:28,2015-01-02 20:14:04,-73.946709,40.714321,-73.961571,40.711475,1,1.29,9.8
2,2014-09-27 17:55:38,2014-09-27 18:19:56,-73.957626,40.718094,-73.947304,40.777813,5,6.12,26.3

In [4]:
green['geometry'] = green.apply(lambda row: 
                    shp.geometry.Point(row['pickup_longitude'],row['pickup_latitude']),axis=1)
green = gpd.GeoDataFrame(green)
green.crs = {'init' :'epsg:4326'}
#green.drop(['pickup_longitude','pickup_latitude'],axis=1,inplace=True)
green[:3]

,pickup_datetime,dropoff_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,trip_distance,total_amount,geometry
0,2015-02-01 01:26:45,2015-02-01 01:49:58,-73.953545,40.811172,-73.984764,40.728386,1,8.11,27.8,POINT (-73.95354 40.81117)
1,2015-01-02 20:06:28,2015-01-02 20:14:04,-73.946709,40.714321,-73.961571,40.711475,1,1.29,9.8,POINT (-73.94671 40.71432)
2,2014-09-27 17:55:38,2014-09-27 18:19:56,-73.957626,40.718094,-73.947304,40.777813,5,6.12,26.3,POINT (-73.95763 40.71809)

In [5]:
Green_NTA = gpd.sjoin(green,weather_geo_demographic[['nta_code','WeatherSta','geometry']], how='inner', op='intersects') 
del Green_NTA['index_right']
len(Green_NTA)
Green_NTA[:3]

,pickup_datetime,dropoff_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,trip_distance,total_amount,geometry,nta_code,WeatherSta
0,2015-02-01 01:26:45,2015-02-01 01:49:58,-73.953545,40.811172,-73.984764,40.728386,1,8.11,27.8,POINT (-73.95354 40.81117),MN09,CP
39,2015-03-31 16:02:29,2015-03-31 16:15:25,-73.962082,40.805218,-73.943817,40.810223,1,2.10,11.8,POINT (-73.96208 40.80522),MN09,CP
41,2014-06-02 16:00:23,2014-06-02 16:12:52,-73.962128,40.805443,-73.987343,40.770370,1,3.10,15.0,POINT (-73.96213 40.80544),MN09,CP

In [6]:
Green_NTA.to_file('Green_NTA.shp')

## Yellow Trips

In [7]:
yellow = pd.read_csv('yellow_trips_new.csv')
#Transforms string to datetime
#yellow['pickup_dt'] = pd.to_datetime(yellow['pickup_datetime'],infer_datetime_format=True)
#yellow['dropoff_dt'] = pd.to_datetime(yellow['dropoff_datetime'],infer_datetime_format=True)
#yellow.drop(['pickup_datetime'],axis=1,inplace=True)
#yellow.drop(['dropoff_datetime'],axis=1,inplace=True)
yellow[:3]

,pickup_datetime,dropoff_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,trip_distance,total_amount
0,2014-04-03 18:28:10,2014-04-03 18:54:32,-74.006033,40.706284,-73.918837,40.744946,1,8.70,34.8
1,2014-04-16 15:42:00,2014-04-16 16:07:00,-73.979558,40.749357,0.000000,0.000000,1,9.37,30.0
2,2014-04-13 18:04:00,2014-04-13 18:07:00,-73.956453,40.775307,-73.954792,40.784992,1,0.89,6.5

In [8]:
yellow['geometry'] = yellow.apply(lambda row: 
                    shp.geometry.Point(row['pickup_longitude'],row['pickup_latitude']),axis=1)
yellow = gpd.GeoDataFrame(yellow)
yellow.crs = {'init' :'epsg:4326'}
#yellow.drop(['pickup_longitude','pickup_latitude'],axis=1,inplace=True)
yellow[:3]

,pickup_datetime,dropoff_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,trip_distance,total_amount,geometry
0,2014-04-03 18:28:10,2014-04-03 18:54:32,-74.006033,40.706284,-73.918837,40.744946,1,8.70,34.8,POINT (-74.00603 40.70628)
1,2014-04-16 15:42:00,2014-04-16 16:07:00,-73.979558,40.749357,0.000000,0.000000,1,9.37,30.0,POINT (-73.97956 40.74936)
2,2014-04-13 18:04:00,2014-04-13 18:07:00,-73.956453,40.775307,-73.954792,40.784992,1,0.89,6.5,POINT (-73.95645 40.77531)

In [ ]:
Yellow_NTA = gpd.sjoin(yellow,weather_geo_demographic[['nta_code','WeatherSta','geometry']], how='inner', op='intersects') 
del Yellow_NTA['index_right']
len(Yellow_NTA)
Yellow_NTA[:3]

In [ ]:
Yellow_NTA.to_file('Yellow_NTA.shp')

## MTA Trips

In [11]:
mta = pd.read_csv('mta_trips.csv')
#Transforms string to datetime
#mta['dt'] = pd.to_datetime(mta['datetime'],infer_datetime_format=True)
#mta.drop(['datetime'],axis=1,inplace=True)
mta[:3]

C:\Users\Giuseppe\Anaconda3\envs\DS4A_test\lib\site-packages\IPython\core\interactiveshell.py:3057: DtypeWarning: Columns (1) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,station,line_name,division,audit_type,unit_id,datetime,new_entries,new_exits,latitude,longitude
0,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 05:00:00,4,6,40.703087,-74.012994
1,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 09:00:00,1,13,40.703087,-74.012994
2,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 13:00:00,1,8,40.703087,-74.012994

In [12]:
mta['geometry'] = mta.apply(lambda row: 
                    shp.geometry.Point(row['longitude'],row['latitude']),axis=1)
mta = gpd.GeoDataFrame(mta)
mta.crs = {'init' :'epsg:4326'}
#mta.drop(['longitude','latitude'],axis=1,inplace=True)
mta[:10]

,station,line_name,division,audit_type,unit_id,datetime,new_entries,new_exits,latitude,longitude,geometry
0,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 05:00:00,4,6,40.703087,-74.012994,POINT (-74.01299 40.70309)
1,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 09:00:00,1,13,40.703087,-74.012994,POINT (-74.01299 40.70309)
2,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 13:00:00,1,8,40.703087,-74.012994,POINT (-74.01299 40.70309)
3,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 17:00:00,1,8,40.703087,-74.012994,POINT (-74.01299 40.70309)
4,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/29/2014 21:00:00,2,3,40.703087,-74.012994,POINT (-74.01299 40.70309)
5,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/30/2014 01:00:00,1,6,40.703087,-74.012994,POINT (-74.01299 40.70309)
6,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/30/2014 09:00:00,1,3,40.703087,-74.012994,POINT (-74.01299 40.70309)
7,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/30/2014 13:00:00,3,4,40.703087,-74.012994,POINT (-74.01299 40.70309)
8,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/30/2014 21:00:00,1,7,40.703087,-74.012994,POINT (-74.01299 40.70309)
9,WHITEHALL ST,R1,BMT,REGULAR,R001_A058_01-00-00,03/31/2014 01:00:00,1,3,40.703087,-74.012994,POINT (-74.01299 40.70309)

In [18]:
MTA_NTA = gpd.sjoin(mta,weather_geo_demographic[['nta_code','WeatherSta','geometry']], how='inner', op='intersects') 
del MTA_NTA['index_right']
len(MTA_NTA)
MTA_NTA[:3]

,station,line_name,division,audit_type,unit_id,datetime,new_entries,new_exits,latitude,longitude,geometry,nta_code,WeatherSta
10333,CYPRESS HILLS,J,BMT,REGULAR,R003_J025_00-00-00,03/29/2014 04:00:00,3,24,40.689941,-73.87255,POINT (-73.87255 40.68994),BK83,JFK
10334,CYPRESS HILLS,J,BMT,REGULAR,R003_J025_00-00-00,03/29/2014 08:00:00,49,17,40.689941,-73.87255,POINT (-73.87255 40.68994),BK83,JFK
10335,CYPRESS HILLS,J,BMT,REGULAR,R003_J025_00-00-00,03/29/2014 12:00:00,67,44,40.689941,-73.87255,POINT (-73.87255 40.68994),BK83,JFK

In [ ]:
MTA_NTA.to_file('MTA_NTA.shp')